#
# Generated by Precision RTL Synthesis 32-bit 2015.1.6 (Release Production Release, compiled Wed Jun 10 09:13:13 PDT 2015)
#

## Setup project
file delete -force {vivado_impl_1/vivado_impl_1.ppr}
create_project vivado_impl_1 {vivado_impl_1} -part xcvu080-ffvc1517-1-c
set_property design_mode GateLvl [current_fileset]
add_file -scan_for_includes {vivado_impl_1}
set_property top unsigned_adder [current_fileset]
read_verilog {unsigned_adder.v}
link_design

## Report project
report_property [current_project]
report_property [current_fileset]
report_property [current_fileset -constrset]

## P&R

if { [catch {opt_design -sweep -propconst -quiet} result] } {
  return -code error -errorinfo "can not run opt_design exiting ... $result"
}
if { [catch {place_design} result] } {
  return -code error -errorinfo "can not run place_design exiting ... $result"
}
if { [catch {route_design} result] } {
  return -code error -errorinfo "can not run route_design exiting ... $result"
}
## Output files and reports
write_checkpoint {vivado_impl_1/unsigned_adder_routed.dcp}
write_xdef {vivado_impl_1/routed_unsigned_adder.xdef}
report_timing -path_type full_clock_expanded -sort_by group -nworst 30 -file {vivado_impl_1/unsigned_adder_timing.twr}
report_timing -path_type full_clock_expanded -sort_by group -rise_from * -rise_to * -file {vivado_impl_1/unsigned_adder_short_timing.twr}
report_timing -path_type full_clock_expanded -sort_by group -fall_from * -fall_to * -file {vivado_impl_1/unsigned_adder_short_timing.twr} -append
report_timing -path_type full_clock_expanded -sort_by group -rise_from * -fall_to * -file {vivado_impl_1/unsigned_adder_short_timing.twr} -append
report_timing -path_type full_clock_expanded -sort_by group -fall_from * -rise_to * -file {vivado_impl_1/unsigned_adder_short_timing.twr} -append
report_timing_summary -file {vivado_impl_1/unsigned_adder_sum_timing.twr}
report_utilization -file {vivado_impl_1/unsigned_adder_utilization.rpt}
report_clock_utilization -file {vivado_impl_1/unsigned_adder_clock_utilization.rpt}
report_io -file {vivado_impl_1/unsigned_adder_io.rpt}
exit

